status/2022/0128.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-29 Sat 06:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>22 January 2022 - 28 January 2022</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Daniel Kelley" />
</head>
<body>
<div id="content">
<h1 class="title">22 January 2022 - 28 January 2022</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgba8e02a">1. MIT OCW</a>
<ul>
<li><a href="#orgb71ae3b">1.1. 18.02 - Multiple Variable Calculus</a>
<ul>
<li><a href="#org09a5ba0">1.1.1. Sessions 14-16, PS2</a></li>
</ul>
</li>
<li><a href="#org84f22f2">1.2. 8.01X+8.01L - Physics I - Classical Mechanics with Labs</a>
<ul>
<li><a href="#orgae3b98c">1.2.1. Still in U/P Chapter 5 reading.</a></li>
</ul>
</li>
<li><a href="#orgbd92434">1.3. 21G.701 Spanish</a>
<ul>
<li><a href="#org1c211ad">1.3.1. Finished Episodes 4-6</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0a4f190">2. CGR-101</a>
<ul>
<li><a href="#org469a923">2.1. Prefix handling</a></li>
</ul>
</li>
<li><a href="#org81d4880">3. Mill Controller #2</a></li>
<li><a href="#orgab3a1ec">4. WWVB Decoder</a></li>
<li><a href="#org2dbe331">5. Santa Cruz Weather Station</a></li>
<li><a href="#orgf93c3a1">6. Marble Computation</a>
<ul>
<li><a href="#orga923084">6.1. Next Steps</a>
<ul>
<li><a href="#org77995bb">6.1.1. Continue Reversible Computation Study</a></li>
<li><a href="#org5c3ba6d">6.1.2. Prototype Marble inverter</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8f9665c">7. ca-r</a>
<ul>
<li><a href="#orgee94688">7.1. Next Step</a></li>
</ul>
</li>
<li><a href="#orgc945b54">8. us-index-map</a>
<ul>
<li><a href="#org6175f87">8.1. error analysis</a></li>
</ul>
</li>
<li><a href="#org88409f2">9. Sun Ultra 10</a>
<ul>
<li><a href="#orgbac9aa1">9.1. Next steps</a>
<ul>
<li><a href="#org8c0ac24">9.1.1. Serial debug</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8802eb2">10. Apple iMac G4</a>
<ul>
<li><a href="#org4d4d0c2">10.1. Next steps</a></li>
</ul>
</li>
<li><a href="#orgeff85a6">11. Davies Brothel</a>
<ul>
<li><a href="#org0e93535">11.1. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#org8494a22">11.2. Next hearing 4/5/2022.</a></li>
</ul>
</li>
<li><a href="#orgb23e9c4">12. Peter Kim</a>
<ul>
<li><a href="#org78457db">12.1. Broadcom CSG Employee indicted for trade secret theft.</a></li>
<li><a href="#orgb945c8c">12.2. United States v. Kim (5:21-cr-00438).</a></li>
<li><a href="#org6586037">12.3. Next hearing: 1/31/2022 01:30 PM</a></li>
</ul>
</li>
<li><a href="#orga6fbd3f">13. Linux Audio</a>
<ul>
<li><a href="#org34be2b5">13.1. pvanal to spectrogram</a>
<ul>
<li><a href="#org7cb1ae3">13.1.1. Next steps</a></li>
</ul>
</li>
<li><a href="#orgb842cf7">13.2. CSound programming.</a>
<ul>
<li><a href="#org13a5819">13.2.1. Next Steps</a></li>
</ul>
</li>
<li><a href="#orgc3176ea">13.3. Faust programming</a>
<ul>
<li><a href="#org34b803e">13.3.1. Next Steps</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0f2db5e">14. EPICS</a>
<ul>
<li><a href="#org6978b37">14.1. Next steps</a>
<ul>
<li><a href="#org4521edd">14.1.1. CGR-101 SCPI interface</a></li>
<li><a href="#org0890171">14.1.2. u3scpi network port testing</a></li>
<li><a href="#orgc939d84">14.1.3. initial EPICS interface</a></li>
<li><a href="#orgaee64ee">14.1.4. u3scpi analog/digital port reconfiguration.</a></li>
<li><a href="#orga3ed332">14.1.5. u3scpi 'DIGITIZER' subsystem.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7eb8d05">15. Brini Tracker II</a>
<ul>
<li><a href="#org182c7a9">15.1. Next steps</a>
<ul>
<li><a href="#org05af2ab">15.1.1. Validate remaining standard GPS messages</a></li>
<li><a href="#org4e45076">15.1.2. Investigate GPS chipset data logging</a></li>
<li><a href="#org33a459a">15.1.3. Investigate LoRA radio interface</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org625c5e7">16. wktcolor</a>
<ul>
<li><a href="#org4c5c5f5">16.1. Next steps</a>
<ul>
<li><a href="#org9b2866b">16.1.1. Explore how to get a minimal coloring</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org648d5b8">17. wktplot</a>
<ul>
<li><a href="#orgce18027">17.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org014fc15">18. AMDGPU</a>
<ul>
<li><a href="#orgbdfbd27">18.1. Next step</a>
<ul>
<li><a href="#org16e5d0d">18.1.1. Reverse engineer HSAKMT programming.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge5e7a7e">19. Ninja v Make</a>
<ul>
<li><a href="#orga37d1da">19.1. Next Step</a>
<ul>
<li><a href="#org30fce83">19.1.1. clean simple measurements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org37c2fe5">20. GMP Forth</a>
<ul>
<li><a href="#org66f17b7">20.1. Need to think about adding floating point support</a></li>
<li><a href="#org22c1c19">20.2. Port to non-Linux OS</a></li>
</ul>
</li>
<li><a href="#org2819532">21. Books</a></li>
</ul>
</div>
</div>
<p>
Back to "no rain" normal.
</p>

<div id="outline-container-orgba8e02a" class="outline-2">
<h2 id="orgba8e02a"><span class="section-number-2">1</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgb71ae3b" class="outline-3">
<h3 id="orgb71ae3b"><span class="section-number-3">1.1</span> 18.02 - Multiple Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org09a5ba0" class="outline-4">
<h4 id="org09a5ba0"><span class="section-number-4">1.1.1</span> Sessions 14-16, PS2</h4>
</div>
</div>
<div id="outline-container-org84f22f2" class="outline-3">
<h3 id="org84f22f2"><span class="section-number-3">1.2</span> 8.01X+8.01L - Physics I - Classical Mechanics with Labs</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgae3b98c" class="outline-4">
<h4 id="orgae3b98c"><span class="section-number-4">1.2.1</span> Still in U/P Chapter 5 reading.</h4>
</div>
</div>
<div id="outline-container-orgbd92434" class="outline-3">
<h3 id="orgbd92434"><span class="section-number-3">1.3</span> 21G.701 Spanish</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org1c211ad" class="outline-4">
<h4 id="org1c211ad"><span class="section-number-4">1.3.1</span> Finished Episodes 4-6</h4>
</div>
</div>
</div>
<div id="outline-container-org0a4f190" class="outline-2">
<h2 id="org0a4f190"><span class="section-number-2">2</span> CGR-101</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org469a923" class="outline-3">
<h3 id="org469a923"><span class="section-number-3">2.1</span> Prefix handling</h3>
</div>
</div>
<div id="outline-container-org81d4880" class="outline-2">
<h2 id="org81d4880"><span class="section-number-2">3</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-3">
<p>
Display controller motherboard dead. Looking for replacement with
VGA and PS/2 connectors (may have laying around).
</p>
</div>
</div>
<div id="outline-container-orgab3a1ec" class="outline-2">
<h2 id="orgab3a1ec"><span class="section-number-2">4</span> WWVB Decoder</h2>
<div class="outline-text-2" id="text-4">
<p>
Need to re-think.
</p>
</div>
</div>
<div id="outline-container-org2dbe331" class="outline-2">
<h2 id="org2dbe331"><span class="section-number-2">5</span> Santa Cruz Weather Station</h2>
<div class="outline-text-2" id="text-5">
<p>
Added restart to systemd unit file.
<a href="https://github.com/daniel-kelley/sczwx/pull/10">https://github.com/daniel-kelley/sczwx/pull/10</a>
</p>
</div>
</div>
<div id="outline-container-orgf93c3a1" class="outline-2">
<h2 id="orgf93c3a1"><span class="section-number-2">6</span> Marble Computation</h2>
<div class="outline-text-2" id="text-6">
<p>
Collected materials (thin copper plate, copper PCB blanks) for prototyping.
</p>
</div>
<div id="outline-container-orga923084" class="outline-3">
<h3 id="orga923084"><span class="section-number-3">6.1</span> Next Steps</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org77995bb" class="outline-4">
<h4 id="org77995bb"><span class="section-number-4">6.1.1</span> Continue Reversible Computation Study</h4>
</div>
<div id="outline-container-org5c3ba6d" class="outline-4">
<h4 id="org5c3ba6d"><span class="section-number-4">6.1.2</span> Prototype Marble inverter</h4>
<div class="outline-text-4" id="text-6-1-2">
<p>
Using dual rail differential logic (left/,right/1), an inverter
merely switches sides. Now thinking an over-center spring controlling
a 'side gate' controlled by a pair of sense levers. Now that there's
a pile of small magnets for physics experiments, maybe something that
uses those?
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org8f9665c" class="outline-2">
<h2 id="org8f9665c"><span class="section-number-2">7</span> ca-r</h2>
<div class="outline-text-2" id="text-7">
<p>
Issue #33 seems to have fixed itself.
</p>
</div>
<div id="outline-container-orgee94688" class="outline-3">
<h3 id="orgee94688"><span class="section-number-3">7.1</span> Next Step</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Wait for further breakage.
</p>
</div>
</div>
</div>
<div id="outline-container-orgc945b54" class="outline-2">
<h2 id="orgc945b54"><span class="section-number-2">8</span> us-index-map</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org6175f87" class="outline-3">
<h3 id="org6175f87"><span class="section-number-3">8.1</span> error analysis</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Started an error analysis on the USGS topomaps<sub>all.csv</sub> index file. Nothing obvious pops up,
and the error reported by Maureen would be impossible to catch anyway.
</p>
</div>
</div>
</div>
<div id="outline-container-org88409f2" class="outline-2">
<h2 id="org88409f2"><span class="section-number-2">9</span> Sun Ultra 10</h2>
<div class="outline-text-2" id="text-9">
<p>
Trying to see what state it is in. Fires up but no video. Need DB25M to
debug over serial port.
</p>
</div>
<div id="outline-container-orgbac9aa1" class="outline-3">
<h3 id="orgbac9aa1"><span class="section-number-3">9.1</span> Next steps</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-org8c0ac24" class="outline-4">
<h4 id="org8c0ac24"><span class="section-number-4">9.1.1</span> Serial debug</h4>
</div>
</div>
</div>
<div id="outline-container-org8802eb2" class="outline-2">
<h2 id="org8802eb2"><span class="section-number-2">10</span> Apple iMac G4</h2>
<div class="outline-text-2" id="text-10">
<p>
Building userland may be a PITA due to lack of RAM. Build would often
segfault.
</p>
</div>
<div id="outline-container-org4d4d0c2" class="outline-3">
<h3 id="org4d4d0c2"><span class="section-number-3">10.1</span> Next steps</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Not sure.
</p>
</div>
</div>
</div>

<div id="outline-container-orgeff85a6" class="outline-2">
<h2 id="orgeff85a6"><span class="section-number-2">11</span> Davies Brothel</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org0e93535" class="outline-3">
<h3 id="org0e93535"><span class="section-number-3">11.1</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-org8494a22" class="outline-3">
<h3 id="org8494a22"><span class="section-number-3">11.2</span> Next hearing 4/5/2022.</h3>
</div>
</div>
<div id="outline-container-orgb23e9c4" class="outline-2">
<h2 id="orgb23e9c4"><span class="section-number-2">12</span> Peter Kim</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org78457db" class="outline-3">
<h3 id="org78457db"><span class="section-number-3">12.1</span> Broadcom CSG Employee indicted for trade secret theft.</h3>
</div>
<div id="outline-container-orgb945c8c" class="outline-3">
<h3 id="orgb945c8c"><span class="section-number-3">12.2</span> United States v. Kim (5:21-cr-00438).</h3>
</div>
<div id="outline-container-org6586037" class="outline-3">
<h3 id="org6586037"><span class="section-number-3">12.3</span> Next hearing: 1/31/2022 01:30 PM</h3>
</div>
</div>
<div id="outline-container-orga6fbd3f" class="outline-2">
<h2 id="orga6fbd3f"><span class="section-number-2">13</span> Linux Audio</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-org34be2b5" class="outline-3">
<h3 id="org34be2b5"><span class="section-number-3">13.1</span> pvanal to spectrogram</h3>
<div class="outline-text-3" id="text-13-1">
<p>
Enough of libriffr and libpvocf work to start pvoctool
<a href="https://github.com/daniel-kelley/pvoctool">https://github.com/daniel-kelley/pvoctool</a>. Have HDF5 output and
text delimited output for octave. Can import PVOC data to octave
spectrogram for display.
</p>
</div>
<div id="outline-container-org7cb1ae3" class="outline-4">
<h4 id="org7cb1ae3"><span class="section-number-4">13.1.1</span> Next steps</h4>
<div class="outline-text-4" id="text-13-1-1">
<p>
Loop analysis
</p>
</div>
</div>
</div>
<div id="outline-container-orgb842cf7" class="outline-3">
<h3 id="orgb842cf7"><span class="section-number-3">13.2</span> CSound programming.</h3>
<div class="outline-text-3" id="text-13-2">
<p>
The FORTRAN of computer music. Getting up to speed.
</p>
</div>
<div id="outline-container-org13a5819" class="outline-4">
<h4 id="org13a5819"><span class="section-number-4">13.2.1</span> Next Steps</h4>
<div class="outline-text-4" id="text-13-2-1">
</div>
<ol class="org-ol">
<li><a id="org29cd454"></a>loscil demo<br /></li>
<li><a id="org1eabc54"></a>spectrogram loop point analysis<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orgc3176ea" class="outline-3">
<h3 id="orgc3176ea"><span class="section-number-3">13.3</span> Faust programming</h3>
<div class="outline-text-3" id="text-13-3">
</div>
<div id="outline-container-org34b803e" class="outline-4">
<h4 id="org34b803e"><span class="section-number-4">13.3.1</span> Next Steps</h4>
<div class="outline-text-4" id="text-13-3-1">
</div>
<ol class="org-ol">
<li><a id="org41c4610"></a>GAC Patch save/restore<br /></li>
<li><a id="org1f1c96f"></a>LV2 autopatcher<br />
<div class="outline-text-5" id="text-13-3-1-2">
<p>
Exploratory tool to generate (was pd, ecasound, now carla) patch for arbitrary LV2 plugin:
hook up audio inputs to signal source, audio outputs to speakers, control inputs to
control surface, etc.
</p>
</div>
</li>
<li><a id="orga3605b5"></a>OSC control surface<br />
<div class="outline-text-5" id="text-13-3-1-3">
<p>
Some sort of GUI tool (knob/slider) to OSC messages. This may be
as simple as a Faust UI program.
</p>
</div>
</li>
<li><a id="org28b065b"></a>Faust/csound<br />
<div class="outline-text-5" id="text-13-3-1-4">
<p>
See if a faust generated unit works.
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org0f2db5e" class="outline-2">
<h2 id="org0f2db5e"><span class="section-number-2">14</span> EPICS</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-org6978b37" class="outline-3">
<h3 id="org6978b37"><span class="section-number-3">14.1</span> Next steps</h3>
<div class="outline-text-3" id="text-14-1">
</div>
<div id="outline-container-org4521edd" class="outline-4">
<h4 id="org4521edd"><span class="section-number-4">14.1.1</span> CGR-101 SCPI interface</h4>
<div class="outline-text-4" id="text-14-1-1">
<p>
See above&#x2026;
</p>
</div>
</div>
<div id="outline-container-org0890171" class="outline-4">
<h4 id="org0890171"><span class="section-number-4">14.1.2</span> u3scpi network port testing</h4>
</div>
<div id="outline-container-orgc939d84" class="outline-4">
<h4 id="orgc939d84"><span class="section-number-4">14.1.3</span> initial EPICS interface</h4>
</div>
<div id="outline-container-orgaee64ee" class="outline-4">
<h4 id="orgaee64ee"><span class="section-number-4">14.1.4</span> u3scpi analog/digital port reconfiguration.</h4>
</div>
<div id="outline-container-orga3ed332" class="outline-4">
<h4 id="orga3ed332"><span class="section-number-4">14.1.5</span> u3scpi 'DIGITIZER' subsystem.</h4>
</div>
</div>
</div>

<div id="outline-container-org7eb8d05" class="outline-2">
<h2 id="org7eb8d05"><span class="section-number-2">15</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-15">
<p>
Maybe this can be simplified to just the GPS module in 'tracking' mode
(which gets carried around), and a separate docking module to extract
the data.
</p>
</div>
<div id="outline-container-org182c7a9" class="outline-3">
<h3 id="org182c7a9"><span class="section-number-3">15.1</span> Next steps</h3>
<div class="outline-text-3" id="text-15-1">
</div>
<div id="outline-container-org05af2ab" class="outline-4">
<h4 id="org05af2ab"><span class="section-number-4">15.1.1</span> Validate remaining standard GPS messages</h4>
</div>
<div id="outline-container-org4e45076" class="outline-4">
<h4 id="org4e45076"><span class="section-number-4">15.1.2</span> Investigate GPS chipset data logging</h4>
</div>
<div id="outline-container-org33a459a" class="outline-4">
<h4 id="org33a459a"><span class="section-number-4">15.1.3</span> Investigate LoRA radio interface</h4>
</div>
</div>
</div>

<div id="outline-container-org625c5e7" class="outline-2">
<h2 id="org625c5e7"><span class="section-number-2">16</span> wktcolor</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-org4c5c5f5" class="outline-3">
<h3 id="org4c5c5f5"><span class="section-number-3">16.1</span> Next steps</h3>
<div class="outline-text-3" id="text-16-1">
</div>
<div id="outline-container-org9b2866b" class="outline-4">
<h4 id="org9b2866b"><span class="section-number-4">16.1.1</span> Explore how to get a minimal coloring</h4>
<div class="outline-text-4" id="text-16-1-1">
<p>
Need a specific planar graph four coloring.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org648d5b8" class="outline-2">
<h2 id="org648d5b8"><span class="section-number-2">17</span> wktplot</h2>
<div class="outline-text-2" id="text-17">
</div>
<div id="outline-container-orgce18027" class="outline-3">
<h3 id="orgce18027"><span class="section-number-3">17.1</span> Next steps</h3>
<div class="outline-text-3" id="text-17-1">
<p>
Understand why -r doesn't solve the wktvor/wktdel "sliver at edge" problem.
Explore biological cell Voronoi organization
</p>
</div>
</div>
</div>

<div id="outline-container-org014fc15" class="outline-2">
<h2 id="org014fc15"><span class="section-number-2">18</span> AMDGPU</h2>
<div class="outline-text-2" id="text-18">
</div>
<div id="outline-container-orgbdfbd27" class="outline-3">
<h3 id="orgbdfbd27"><span class="section-number-3">18.1</span> Next step</h3>
<div class="outline-text-3" id="text-18-1">
</div>
<div id="outline-container-org16e5d0d" class="outline-4">
<h4 id="org16e5d0d"><span class="section-number-4">18.1.1</span> Reverse engineer HSAKMT programming.</h4>
</div>
</div>
</div>

<div id="outline-container-orge5e7a7e" class="outline-2">
<h2 id="orge5e7a7e"><span class="section-number-2">19</span> Ninja v Make</h2>
<div class="outline-text-2" id="text-19">
</div>
<div id="outline-container-orga37d1da" class="outline-3">
<h3 id="orga37d1da"><span class="section-number-3">19.1</span> Next Step</h3>
<div class="outline-text-3" id="text-19-1">
</div>
<div id="outline-container-org30fce83" class="outline-4">
<h4 id="org30fce83"><span class="section-number-4">19.1.1</span> clean simple measurements</h4>
</div>
</div>
</div>

<div id="outline-container-org37c2fe5" class="outline-2">
<h2 id="org37c2fe5"><span class="section-number-2">20</span> GMP Forth</h2>
<div class="outline-text-2" id="text-20">
</div>
<div id="outline-container-org66f17b7" class="outline-3">
<h3 id="org66f17b7"><span class="section-number-3">20.1</span> Need to think about adding floating point support</h3>
</div>
<div id="outline-container-org22c1c19" class="outline-3">
<h3 id="org22c1c19"><span class="section-number-3">20.2</span> Port to non-Linux OS</h3>
</div>
</div>

<div id="outline-container-org2819532" class="outline-2">
<h2 id="org2819532"><span class="section-number-2">21</span> Books</h2>
<div class="outline-text-2" id="text-21">
<p>
Sapiens: A Graphic History (vol.1 and 2) by Yuval Noah Harari
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2022-01-29 Sat 06:10</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
